## 2ª Rodada de Questões do CEO

### Bibliotecas

In [1]:
from sqlalchemy import create_engine
import pandas as pd

### Acessando o Banco de Dados

In [2]:
# Conexão com o Banco
engine = create_engine('sqlite:///db_olist.sqlite')

# Criando a conexão com o Banco
cursor = engine.connect()

**1.** Qual o número de clientes únicos do estado de Minas Gerais?

In [3]:
query = """
    SELECT 
        COUNT(c.customer_unique_id) AS quant_clientes_unicos 
    FROM 
        customer c
    WHERE
        c.customer_state = 'MG'
"""

pd.read_sql(query, cursor)

   quant_clientes_unicos
0                  11635

**2.** Qual a quantidade de cidades únicas dos vendedores do estado de Santa Catarina?

In [4]:
query = """
    SELECT
        COUNT(DISTINCT s.seller_city) AS cidades_unicas_vendedores 
    FROM
        sellers s 
    WHERE 
        s.seller_state = 'SC'
"""

pd.read_sql(query, cursor)

   cidades_unicas_vendedores
0                         65

**3.** Qual a quantidade de cidades únicas de todos os vendedores da base?

In [5]:
query = """
    SELECT 
        COUNT( DISTINCT s.seller_city ) AS cidades_unicas_vendedores 
    FROM 
        sellers s 
"""

pd.read_sql(query, cursor)

   cidades_unicas_vendedores
0                        611

**4.** Qual o número total de pedidos únicos acima de RS 3.500?

In [6]:
query = """
    SELECT 
        COUNT(DISTINCT oi.order_id) AS pedidod_unicos
    FROM 
        order_items oi 
    WHERE
        oi.price > 3500
"""

pd.read_sql(query, cursor)

   pedidod_unicos
0              18

**5.** Qual o valor médio do preço de todos os pedidos?

In [7]:
query = """
    SELECT 
        AVG(oi.price) AS preco_medio 
    FROM
        order_items oi
    """

pd.read_sql(query, cursor)

   preco_medio
0   120.653739

**6.** Qual o maior valor de preço entre todos os pedidos?

In [8]:
query = """
    SELECT 
        oi.order_id, 
        MAX(oi.price) AS max_price
    FROM 
        order_items oi  
    """

pd.read_sql(query, cursor)

                           order_id  max_price
0  0812eb902a67711a1cb742b3cdaa65ae     6735.0

**7.** Qual o menor valor de preço entre todos os pedidos?

In [9]:
query = """
    SELECT
        oi.order_id, MIN(oi.price) AS min_price 
    FROM 
        order_items oi 
    """

pd.read_sql(query, cursor)

                           order_id  min_price
0  3ee6513ae7ea23bdfab5b9ab60bffcb5       0.85

**8.** Qual a quantidade de produtos distintos vendidos abaixo do preço de RS100.00?

In [10]:
query = """
    SELECT 
        COUNT(DISTINCT oi.product_id) AS quant_prod_unico 
    FROM
        order_items oi 
    WHERE 
        oi.price < 100 
    """

pd.read_sql(query, cursor)

   quant_prod_unico
0             20112

**9.** Qual a quantidade de vendedores distintos que receberam algum pedido antes do dia 23 de setembro de 2016?

In [11]:
query = """
    SELECT 
        COUNT(DISTINCT oi.seller_id) AS num_sellers
    FROM 
        order_items oi 
    WHERE 
        oi.shipping_limit_date < '2016-09-23'
    """

pd.read_sql(query, cursor)

   num_sellers
0            2

**10.** Quais os tipos de pagamentos existentes?

In [12]:
 query = """
    SELECT 
        DISTINCT op.payment_type AS payment_unique_type 
    FROM 
        order_payments op 
    """

pd.read_sql(query, cursor)

  payment_unique_type
0         credit_card
1              boleto
2             voucher
3          debit_card
4         not_defined

**11.** Qual o maior número de parcelas realizado?

In [13]:
 query = """
    SELECT
        MAX(op.payment_installments) AS max_installments 
    FROM
        order_payments op  
    """

pd.read_sql(query, cursor)

   max_installments
0                24

**12.** Qual o menor número de parcelas realizado?

In [14]:
 query = """
    SELECT
        MIN(op.payment_installments) AS min_installments 
    FROM 
        order_payments op  
    """

pd.read_sql(query, cursor)

   min_installments
0                 0

**13.** Qual a média do valor pago no cartão de crédito?

In [15]:
 query = """
    SELECT 
        AVG(op.payment_value) AS mean_payments_credit_card 
    FROM 
        order_payments op 
    WHERE
        op.payment_type = 'credit_card'
    """

pd.read_sql(query, cursor)

   mean_payments_credit_card
0                 163.319021

**14.** Quantos tipos de status para um pedido existem?

In [16]:
 query = """
    SELECT
        COUNT( DISTINCT o.order_status ) AS num_types_order_status 
    FROM 
        orders o 
    """

pd.read_sql(query, cursor)

   num_types_order_status
0                       8

**15.** Quais os tipos de status para um pedido?

In [17]:
 query = """
    SELECT 
        DISTINCT o.order_status AS types_orders_status
    FROM 
        orders o 
    """

pd.read_sql(query, cursor)

  types_orders_status
0           delivered
1            invoiced
2             shipped
3          processing
4         unavailable
5            canceled
6             created
7            approved

**16.** Quantos clientes distintos fizeram um pedido?

In [18]:
 query = """
        SELECT
        COUNT( DISTINCT o.customer_id ) AS quant_clientes_distintos 
    FROM 
        orders o 
    """

pd.read_sql(query, cursor)

   quant_clientes_distintos
0                     99441

**17.** Quantos produtos estão cadastrados na empresa?

In [19]:
 query = """
    SELECT
        COUNT(DISTINCT p.product_id) AS quant_product 
    FROM 
        products p 
    """

pd.read_sql(query, cursor)

   quant_product
0          32951

**18.** Qual a quantidade máxima de fotos de um produto?

In [20]:
 query = """
    SELECT
        p.product_id , MAX(p.product_photos_qty) AS num_max_photos
    FROM 
        products p 
    """

pd.read_sql(query, cursor)

                         product_id  num_max_photos
0  f95d5d21561ea085ba1e1a4e53840844            20.0

**19.** Qual o maior valor do peso entre todos os produtos?

In [21]:
 query = """
    SELECT 
        p.product_id , MAX(DISTINCT p.product_weight_g) AS max_weight  
    FROM
        products p 
    """

pd.read_sql(query, cursor)

                         product_id  max_weight
0  c5ef13c4546279ceb81432eaef3cef41     40425.0

**20.** Qual a altura média dos produtos?

In [22]:
query = """
    SELECT
        AVG(DISTINCT p.product_height_cm) AS avg_height 
    FROM 
        products p 
    """

pd.read_sql(query, cursor)

   avg_height
0   52.666667